<template>
    <div>
      <TheBanner title="រចនាសម្ព័ន្ធស្ថាប័ន" />
  
      <section class="max-w-screen-lg mx-auto mt-20 flex flex-col gap-10">
  
        <section>
  
          <TheHeading title="រចនាសម្ព័ន្ធស្ថាប័ន">
            <!-- <template #icon>
              <svg xmlns="http://www.w3.org/2000/svg" width="32px" height="32px" viewBox="0 0 24 24">
                <path fill="currentColor"
                  d="M11 9h2V7h-2m1 13c-4.41 0-8-3.59-8-8s3.59-8 8-8s8 3.59 8 8s-3.59 8-8 8m0-18A10 10 0 0 0 2 12a10 10 0 0 0 10 10a10 10 0 0 0 10-10A10 10 0 0 0 12 2m-1 15h2v-6h-2z" />
              </svg>
            </template> -->
          </TheHeading>
  
          <p>
            រចនាសម្ព័ន្ធស្ថាប័ន
            ក្រុមប្រឹក្សាភិបាលគ្រប់គ្រងមូលនិធិវិនិយោគរដ្ឋបាលថ្នាក់ក្រោមជាតិដែលសរសេរកាត់ថា ក.វ.ក គឺជាអ្នកគ្រប់គ្រងមូលនិធិវិនិយោគរដ្ឋបាលថ្នាក់ក្រោមជាតិដែលមានសមាសភាពមកពីក្រសួង-ស្ថាប័នរួមមាន៖ 
          </p>
          <ul class="pl-8 list-disc">
            <li>រដ្ឋមន្ត្រីក្រសួងសេដ្ឋកិច្ច និងហិរញ្ញវត្ថុ                 <b>ប្រធាន</b></li>
            <li>  រដ្ឋលេខាធិការក្រសួងសេដ្ឋកិច្ច និងហិរញ្ញវត្ថុ                  <b>អនុប្រធាន</b></li>
            <li>តំណាងក្រសួងមហាផ្ទៃ                                                   <b>អនុប្រធាន</b>  </li>
            <li> តំណាងទីស្តីការគណៈរដ្ឋមន្រ្តី                      <b>សមាជិក</b></li>
            <li>តំណាងលេខាធិការដ្ឋានគ.ជ.អ.ប              <b>សមាជិក</b></li>
            <li>តំណាងក្រសួងផែនការ                                                         <b>សមាជិក</b></li>
            <li>តំណាងក្រសួងអភិវឌ្ឍន៍ជនបទ                                               <b>សមាជិក</b> </li>
            <li>តំណាងក្រសួងមុខងារសាធារណៈ                                          <b>សមាជិក</b></li>
            <li>តំណាងក្រសួងកិច្ចការនារី                                                 <b>សមាជិក</b></li>
            <li>តំណាងក្រសួងសាធារណៈការ និងដឹកជញ្ជូន                                 <b>សមាជិក</b></li>
            <li>តំណាងក្រសួងរៀបចំដែនដី នគរូបនីយកម្ម និងសំណង់                   <b>សមាជិក</b></li>
            <li>តំណាងក្រសួងបរិស្ថាន                                                    <b>សមាជិក</b></li>
            <li>តំណាងក្រសួងអប់រំ យុវជន និងកីឡា                                          <b>សមាជិក</b></li>
            <li>តំណាងក្រសួងសុខាភិបាល                                                     <b>សមាជិក</b></li>
            <li>តំណាងក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ                             <b>សមាជិក</b></li>
            <li>តំណាងក្រសួងធនធានទឹក និងឧតុនិយម                                     <b>សមាជិក</b></li>
            <li>តំណាងក្រសួងរ៉ែ និងថាមពល             <b>សមាជិក</b></li>
            <li>តំណាងក្រសួងឧស្សាហកម្ម និងសិប្បកម្ម                            <b>សមាជិក</b></li>
            <li>តំណាងសមាគមក្រុមប្រឹក្សារាជធានី  ខេត្ត                                     <b>សមាជិក</b></li>
            <li>តំណាងសម្ព័ន្ធភាពជាតិសមាគមក្រុមប្រឹក្សាក្រុង ស្រុក ខណ្ឌ ឃុំ សង្កាត់    <b>សមាជិក</b>           </li>
            <li>ប្រធានលេខាធិការដ្ឋាន ក.វ.ក                                                <b>សមាជិក</b></li>
          </ul>
        </section>
  
        <section>
          <img src="../assets/img/about-1.png" class="w-full" alt="">
        </section>
  
      </section>
  
    </div>
  </template>
  
  <script setup lang="ts">
  import TheBanner from '@/components/blocks/TheBanner.vue';
  import TheHeading from '@/components/blocks/TheHeading.vue';
  
  </script>
  