<template>
  <div>
    <TheBanner title="សេចក្តីសង្ខេប អំពី ក.វ.ក" />

    <section class="max-w-screen-lg mx-auto mt-20 flex flex-col gap-10">

      <section>

        <TheHeading title="សេចក្តីសង្ខេប អំពី ក.វ.ក">
          <!-- <template #icon>
            <svg xmlns="http://www.w3.org/2000/svg" width="32px" height="32px" viewBox="0 0 24 24">
              <path fill="currentColor"
                d="M11 9h2V7h-2m1 13c-4.41 0-8-3.59-8-8s3.59-8 8-8s8 3.59 8 8s-3.59 8-8 8m0-18A10 10 0 0 0 2 12a10 10 0 0 0 10 10a10 10 0 0 0 10-10A10 10 0 0 0 12 2m-1 15h2v-6h-2z" />
            </svg>
          </template> -->
        </TheHeading>

        <p>
          រាជរដ្ឋាភិបាលនៃព្រះរាជាណាចក្រកម្ពុជាបានបង្កើត មូលនិធិវិនិយោគរដ្ឋបាលថ្នាក់ក្រោមជាតិ តាមរយៈអនុក្រឹត្យលេខ៣២ អនក្រ.បក ចុះថ្ងៃទី២៩ ខែកុម្ភៈ ឆ្នាំ២០១៦ ក្នុងគោលបំណងលើកកម្ពស់ការអភិវឌ្ឍសង្គមសេដ្ឋកិច្ចនៅថ្នាក់ក្រោមជាតិដោយផ្តល់ហិរញ្ញប្បទានទៅដល់គម្រោងវិនិយោគសាធារណៈរបស់រដ្ឋបាលថ្នាក់ក្រោមជាតិដែលមានលក្ខណៈយុទ្ធសាស្ត្រ និងផ្តល់ការលើកទឹកចិត្តដល់រដ្ឋបាលថ្នាក់ក្រោមជាតិដើម្បីលើកកម្ពស់ការបំពេញភារកិច្ច និងការគ្រប់គ្រងការវិនិយោគសាធារណៈឲ្យកាន់តែប្រសើរ។ មូលនិធិវិនិយោគរដ្ឋបាលថ្នាក់ក្រោមជាតិ (SNIF) ជាយន្តការថ្មីមួយដែលផ្តល់ធនធានបន្ថែមទៅដល់រដ្ឋបាលថ្នាក់ក្រោមជាតិតាមរយៈការប្រកួតប្រជែងលើសមិទ្ធកម្មប្រចាំឆ្នាំដែលរដ្ឋបាលថ្នាក់ក្រោមជាតិនីមួយៗសម្រេចបាន។
        </p>
      </section>
      </section>


  </div>
</template>

<script setup lang="ts">
import TheBanner from '@/components/blocks/TheBanner.vue';
import TheHeading from '@/components/blocks/TheHeading.vue';

</script>
