<template>
  <div>
    <TheBanner title="សិក្ខាសាលា" />
    <section class="max-w-screen-md mx-auto mt-20 flex flex-col gap-10">

      <div class="flex flex-col gap-4">
        <TheHeading title="សិក្ខាសាលា" :sub-title="workDetail?.title">
          <template #icon>
            <svg xmlns="http://www.w3.org/2000/svg" width="32px" height="32px" viewBox="0 0 24 24">
              <g fill="none" stroke="currentColor" stroke-linecap="round" stroke-linejoin="round" stroke-width="2">
                <path d="M22 9L12 5L2 9l10 4zv6" />
                <path d="M6 10.6V16a6 3 0 0 0 12 0v-5.4" />
              </g>
            </svg>
          </template>
        </TheHeading>
        <span class="text-slate-600">{{ workDetail?.datetime }}</span>
      </div>
      <div v-if="workDetail?.category =='kbs2'">
          <p class="text-2xl text-center font-bold pb-4">សូមគោរពជូន</p>
          <p class="text-center">  ឯកឧត្តមប្រតិភូរាជរដ្ឋាភិបាលទទួលបន្ទុកជាអគ្គនាយក នៃអគ្គនាយកដ្ឋានហិរញ្ញវត្ថុរដ្ឋបាលថ្នាក់ក្រោមជាតិ និងជា ប្រធានលេខាធិការដ្ឋាន ក.វ.ក </p>
          <p><b>កម្មវត្ថុ៖	</b>របាយការណ៍លទ្ធផលសិក្ខាសាលាផ្សព្វផ្សាយ និងបណ្តុះបណ្តាលគោលការណ៍ណែនាំស្តីពីការវាយតម្លៃសមិទ្ធកម្មប្រចាំឆ្នាំសម្រាប់រដ្ឋបាលក្រុង ស្រុក។</p> <br/>

          <p>សេចក្តីដូចមានចែងក្នុងកម្មវត្ថុខាងលើ ខ្ញុំបាទសូមគោរពជម្រាបជូន ឯកឧត្តមប្រតិភូរាជរដ្ឋាភិបាល មេត្តាជ្រាបថា៖ នាព្រឹកថ្ងៃចន្ទ ១១ រោច ខែបុស្ស ឆ្នាំថោះ បញ្ចាស័ក ព.ស.​២៥៦៧ 
          ត្រូវនឹងថ្ងៃទី០៥ ខែកុម្ភៈ ឆ្នាំ២០២៤ វេលាម៉ោង ០៩:០០ នាទីព្រឹក នៅសណ្ឋាគារ អិលប៊ីអិនអាស៊ាន នៃខេត្តកំពង់ចាម, លេខាធិការដ្ឋាននៃក្រុមប្រឹក្សាភិបាលគ្រប់គ្រងមូលនិធិវិនិយោគរដ្ឋបាលថ្នាក់ក្រោមជាតិ 
          (លេខាធិការដ្ឋាន ក.វ.ក) បានរៀបចំសិក្ខាសិលាផ្សព្វផ្សាយ និងបណ្តុះបណ្តាលគោលការណ៍ណែនាំស្តីពីការវាយតម្លៃសមិទ្ធកម្មប្រចាំឆ្នាំសម្រាប់រដ្ឋបាលក្រុង​​​​​​​ ស្រុកដឹកនាំដោយលោក សារឿន សុកុល 
          អនុប្រធានលេខាធិការដ្ឋាន ក.វ.ក និងមានការចូលរួមពីមន្រ្តីទទួលបន្ទុកខេត្ត នៃអគ្គនាយកដ្ឋានហិរញ្ញវត្ថុរដ្ឋបាលថ្នាក់ក្រោមជាតិ, បុគ្គលិកនៃលេខាធិការដ្ឋាន ក.វ.ក ព្រមទាំងតំណាងនៃរដ្ឋបាលខេត្តកំពង់ចាម, 
          តំណាងមន្ទីរសេដ្ឋកិច្ច និងហិរញ្ញវត្ថុខេត្ត, តំណាងរតនាគារខេត្ត និងអភិបាលនៃគណៈអភិបាលក្រុង ស្រុក អមដោយមន្រ្តីជំនាញ នៃរដ្ឋបាលក្រុង ស្រុកគោលដៅទាំង៣៧ 
          នៃខេត្តកំពង់ចាម, ខេត្តក្រចេះ, ខេត្តមណ្ឌលគីរី, ខេត្តព្រៃវែង និងខេត្តស្វាយរៀង។
        </p><br/>
        <p>ជាកិច្ចចាប់ផ្តើម លោក អនុប្រធានលេខាធិការដ្ឋាន ក.វ.ក និងជាគណៈអធិបតី បានមានមតិស្វាគមន៍ដល់អង្គសិក្ខាសាលា និងបានបញ្ចាក់អំពីសារៈសំខាន់នៃសិក្ខាសាលាដែលបានរៀបចំដូចខាងក្រោម៖</p> <br/>
          <ul class="pl-10 list-disc">
            <li>គោលបំណងនៃសិក្ខាសាលាគឺដើម្បីផ្សព្វផ្សាយ និងណែនាំទៅដល់រដ្ឋបាលក្រុង ស្រុកឲ្យបានយល់ដឹងពីយន្តការរបស់មូលនិធិវិនិយោគរដ្ឋបាលថ្នាក់ក្រោមជាតិ ក៏ដូចជាគោលការណ៍ណែនាំ ស្តីពីការវាយតម្លៃសមិទ្ធកម្មប្រចាំឆ្នាំសម្រាប់រដ្ឋបាលក្រុង ស្រុក</li>
            <li>ចក្ខុវិស័យនៃមូលនិធិវិនិយោគរដ្ឋបាលថ្នាក់ក្រោមជាតិ ក្នុងការជួយលើកម្ពស់ដល់ការអនុវត្តថវិការ និងការបំពេញភារកិច្ចរបស់រដ្ឋបាលក្រុង ស្រុកឲ្យកាន់តែប្រសើរទ្បើង</li>
            <li>មូលនិធិវិនិយោគរដ្ឋបាលថ្នាក់ក្រោមជាតិ ឈានដល់ការអនុវត្តជុំទី៨ និងបានកំណត់យករដ្ឋបាលក្រុង ស្រុកនៃខេត្តដែលចូលរួមកាលពីជុំទី១ក្នុងឆ្នាំ២០១៧ និងរដ្ឋបាលក្រុង ស្រុកដែលទើបបង្កើតថ្មី 
              និងមិនទាន់ទទួលបានជ័យលាភីដែលសរុបរដ្ឋបាលក្រុង ស្រុកចំនួន៨០ (ក្រុង១៥ ស្រុក៦៥) ដើម្បីចូលរួមប្រកួតប្រជែងក្នុងឆ្នាំ២០២៤ ហេតុដូចនេះសូមលើកទឹកចិត្តដល់រដ្ឋបាលក្រុងនីមួយៗ
               ក្នុងការចូលរួមប្រកួតប្រជែងការវាយតម្លៃសមិទ្ធកម្មប្រចាំឆ្នាំ ដើម្បីអាចទទួលបានហិរញ្ញប្បទានពីមូលនិធិវិនិយោគរដ្ឋបាលថ្នាក់ក្រោមជាតិ យកទៅអភិវឌ្ឍនៅមូលដ្ឋានរៀងៗខ្លួន។</li>
          </ul><br/>
        <div>
           <p class="text-xl font-bold pb-2"><b>១.របៀបវារៈនៃសិក្ខាសាលា</b></p> 
          <ul  class="pl-10 list-disc">
            <li>បទបង្ហាញស្តីពីវឌ្ឍនភាព និងបទពិសោធន៍នៃការអនុវត្តមូលនិធិវិនិយោគរដ្ឋបាលថ្នាក់ក្រោមជាតិ</li>
            <li>បទបង្ហាញស្តីពីគោលការណ៍ណែនាំការវាយតម្លៃសមិទ្ធកម្មប្រចាំឆ្នាំសម្រប់រដ្ឋបាលក្រុង ស្រុក</li>
            <li>ការរៀបចំព័ត៌មាន/ឯកសារផ្ទៀងផ្ទាត់់ ផ្ញើមកលេខាធិការដ្ឋាន ក.វ.ក</li>
            <li>វេទិកាសំណួរចម្លើយ</li>
            <li>កិច្ចពិភាក្សាទាក់ទងបញ្ហាប្រឈមនៃការអនុវត្តការងារហិរញ្ញវត្ថុនៅរដ្ឋបាលថ្នាក់ជាតិ។</li>
          </ul>
        </div>  
        <div>
          <p class="text-xl font-bold pb-2"><b>២.លទ្ធផលនៃសិក្ខាសាលា</b></p>
          <ul  class="pl-10 list-disc">
            <li>រដ្ឋបាលក្រុង ស្រុកយល់ដឹងអំពីខ្លឹមសារនៃអនុក្រិតលេខ៣២ អនក្រ.បក ចុះថ្ងៃទី២៩ កុម្ភៈ ឆ្នាំ២០១៦ ស្តីពីការរៀបចំ និងការប្រព្រឹត្តទៅនៃមូលនិធិវិនិយោគរដ្ឋបាលថ្នាក់ក្រោមជាតិ</li>
            <li>រដ្ឋបាលក្រុង ស្រុក យល់ដឹងអំពីខ្លឹមសារនៃគោលការណ៍ណៃនាំស្តីពីការវាយតម្លៃសមិទ្ធកម្មប្រចាំឆ្នាំ (អ្វីទៅជាបុរេលក្ខខណ្ឌ? អ្វីទៅជារង្វាស់សមិទ្ធកម្ម?)</li>
            <li>រដ្ឋបាលក្រុង ស្រុកបាលយល់ដឹងអំពីអត្ថប្រយោជន៍នៃការចូលរួមប្រកួតប្រជែងជាមួយលេខាធិការដ្ឋានក.វ.ក</li>
            <li>ការជូនដំណឹងដល់រដ្ឋបាលក្រុង ស្រុកគោលដៅដើម្បីខ្លួនត្រៀមខ្លួនសម្រាប់វាយតម្លៃសមិទ្ធកម្មប្រចាំឆ្នាំ២០២៣។</li>
          </ul>
        </div>
      </div>
      <div v-if="workDetail?.category =='kbs1'">
          <p class="text-2xl text-center font-bold pb-4">សូមគោរពជូន</p>
          <p class="text-center">  ឯកឧត្តមប្រតិភូរាជរដ្ឋាភិបាលទទួលបន្ទុកជាអគ្គនាយក នៃអគ្គនាយកដ្ឋានហិរញ្ញវត្ថុរដ្ឋបាលថ្នាក់ក្រោមជាតិ និងជា ប្រធានលេខាធិការដ្ឋាន ក.វ.ក </p>
          <p><b>កម្មវត្ថុ៖	</b>របាយការណ៍លទ្ធផលសិក្ខាសាលាផ្សព្វផ្សាយ និងបណ្តុះបណ្តាលគោលការណ៍ណែនាំស្តីពីការវាយតម្លៃសមិទ្ធកម្មប្រចាំឆ្នាំសម្រាប់រដ្ឋបាលក្រុង ស្រុក។</p> <br/>

        <p>សេចក្តីដូចមានចែងក្នុងកម្មវត្ថុខាងលើ ខ្ញុំបាទសូមគោរពជម្រាបជូន ឯកឧត្តមប្រតិភូរាជរដ្ឋាភិបាល មេត្តាជ្រាបថា៖ នាព្រឹកថ្ងៃចន្ទ ១១ រោច ខែបុស្ស ឆ្នាំថោះ បញ្ចាស័ក ព.ស.​២៥៦៧ 
          ត្រូវនឹងថ្ងៃទី០៥ ខែកុម្ភៈ ឆ្នាំ២០២៤ វេលាម៉ោង ០៩:០០ នាទីព្រឹក នៅសណ្ឋាគារ អិលប៊ីអិនអាស៊ាន នៃខេត្តកំពង់ចាម, លេខាធិការដ្ឋាននៃក្រុមប្រឹក្សាភិបាលគ្រប់គ្រងមូលនិធិវិនិយោគរដ្ឋបាលថ្នាក់ក្រោមជាតិ 
          (លេខាធិការដ្ឋាន ក.វ.ក) បានរៀបចំសិក្ខាសិលាផ្សព្វផ្សាយ និងបណ្តុះបណ្តាលគោលការណ៍ណែនាំស្តីពីការវាយតម្លៃសមិទ្ធកម្មប្រចាំឆ្នាំសម្រាប់រដ្ឋបាលក្រុង​​​​​​​ ស្រុកដឹកនាំដោយលោក សារឿន សុកុល 
          អនុប្រធានលេខាធិការដ្ឋាន ក.វ.ក និងមានការចូលរួមពីមន្រ្តីទទួលបន្ទុកខេត្ត នៃអគ្គនាយកដ្ឋានហិរញ្ញវត្ថុរដ្ឋបាលថ្នាក់ក្រោមជាតិ, បុគ្គលិកនៃលេខាធិការដ្ឋាន ក.វ.ក ព្រមទាំងតំណាងនៃរដ្ឋបាលខេត្តកំពង់ចាម, 
          តំណាងមន្ទីរសេដ្ឋកិច្ច និងហិរញ្ញវត្ថុខេត្ត, តំណាងរតនាគារខេត្ត និងអភិបាលនៃគណៈអភិបាលក្រុង ស្រុក អមដោយមន្រ្តីជំនាញ នៃរដ្ឋបាលក្រុង ស្រុកគោលដៅទាំង៣៧ 
          នៃខេត្តកំពង់ចាម, ខេត្តក្រចេះ, ខេត្តមណ្ឌលគីរី, ខេត្តព្រៃវែង និងខេត្តស្វាយរៀង។
        </p><br/>
        <p>ជាកិច្ចចាប់ផ្តើម លោក អនុប្រធានលេខាធិការដ្ឋាន ក.វ.ក និងជាគណៈអធិបតី បានមានមតិស្វាគមន៍ដល់អង្គសិក្ខាសាលា និងបានបញ្ចាក់អំពីសារៈសំខាន់នៃសិក្ខាសាលាដែលបានរៀបចំដូចខាងក្រោម៖</p> <br/>
          <ul class="pl-10 list-disc">
            <li>គោលបំណងនៃសិក្ខាសាលាគឺដើម្បីផ្សព្វផ្សាយ និងណែនាំទៅដល់រដ្ឋបាលក្រុង ស្រុកឲ្យបានយល់ដឹងពីយន្តការរបស់មូលនិធិវិនិយោគរដ្ឋបាលថ្នាក់ក្រោមជាតិ ក៏ដូចជាគោលការណ៍ណែនាំ ស្តីពីការវាយតម្លៃសមិទ្ធកម្មប្រចាំឆ្នាំសម្រាប់រដ្ឋបាលក្រុង ស្រុក</li>
            <li>ចក្ខុវិស័យនៃមូលនិធិវិនិយោគរដ្ឋបាលថ្នាក់ក្រោមជាតិ ក្នុងការជួយលើកម្ពស់ដល់ការអនុវត្តថវិការ និងការបំពេញភារកិច្ចរបស់រដ្ឋបាលក្រុង ស្រុកឲ្យកាន់តែប្រសើរទ្បើង</li>
            <li>មូលនិធិវិនិយោគរដ្ឋបាលថ្នាក់ក្រោមជាតិ ឈានដល់ការអនុវត្តជុំទី៨ និងបានកំណត់យករដ្ឋបាលក្រុង ស្រុកនៃខេត្តដែលចូលរួមកាលពីជុំទី១ក្នុងឆ្នាំ២០១៧ និងរដ្ឋបាលក្រុង ស្រុកដែលទើបបង្កើតថ្មី 
              និងមិនទាន់ទទួលបានជ័យលាភីដែលសរុបរដ្ឋបាលក្រុង ស្រុកចំនួន៨០ (ក្រុង១៥ ស្រុក៦៥) ដើម្បីចូលរួមប្រកួតប្រជែងក្នុងឆ្នាំ២០២៤ ហេតុដូចនេះសូមលើកទឹកចិត្តដល់រដ្ឋបាលក្រុងនីមួយៗ
               ក្នុងការចូលរួមប្រកួតប្រជែងការវាយតម្លៃសមិទ្ធកម្មប្រចាំឆ្នាំ ដើម្បីអាចទទួលបានហិរញ្ញប្បទានពីមូលនិធិវិនិយោគរដ្ឋបាលថ្នាក់ក្រោមជាតិ យកទៅអភិវឌ្ឍនៅមូលដ្ឋានរៀងៗខ្លួន។</li>
          </ul><br/>
          <div>
            <p class="text-xl font-bold pb-2"><b>១.របៀបវារៈនៃសិក្ខាសាលា</b></p> 
            <ul  class="pl-10 list-disc">
              <li>បទបង្ហាញស្តីពីវឌ្ឍនភាព និងបទពិសោធន៍នៃការអនុវត្តមូលនិធិវិនិយោគរដ្ឋបាលថ្នាក់ក្រោមជាតិ</li>
              <li>បទបង្ហាញស្តីពីគោលការណ៍ណែនាំការវាយតម្លៃសមិទ្ធកម្មប្រចាំឆ្នាំសម្រប់រដ្ឋបាលក្រុង ស្រុក</li>
              <li>ការរៀបចំព័ត៌មាន/ឯកសារផ្ទៀងផ្ទាត់់ ផ្ញើមកលេខាធិការដ្ឋាន ក.វ.ក</li>
              <li>វេទិកាសំណួរចម្លើយ</li>
              <li>កិច្ចពិភាក្សាទាក់ទងបញ្ហាប្រឈមនៃការអនុវត្តការងារហិរញ្ញវត្ថុនៅរដ្ឋបាលថ្នាក់ជាតិ។</li>
            </ul>
          </div>  
          <div>
            <p class="text-xl font-bold pb-2"><b>២.លទ្ធផលនៃសិក្ខាសាលា</b></p>
            <ul  class="pl-10 list-disc">
              <li>រដ្ឋបាលក្រុង ស្រុកយល់ដឹងអំពីខ្លឹមសារនៃអនុក្រិតលេខ៣២ អនក្រ.បក ចុះថ្ងៃទី២៩ កុម្ភៈ ឆ្នាំ២០១៦ ស្តីពីការរៀបចំ និងការប្រព្រឹត្តទៅនៃមូលនិធិវិនិយោគរដ្ឋបាលថ្នាក់ក្រោមជាតិ</li>
              <li>រដ្ឋបាលក្រុង ស្រុក យល់ដឹងអំពីខ្លឹមសារនៃគោលការណ៍ណៃនាំស្តីពីការវាយតម្លៃសមិទ្ធកម្មប្រចាំឆ្នាំ (អ្វីទៅជាបុរេលក្ខខណ្ឌ? អ្វីទៅជារង្វាស់សមិទ្ធកម្ម?)</li>
              <li>រដ្ឋបាលក្រុង ស្រុកបាលយល់ដឹងអំពីអត្ថប្រយោជន៍នៃការចូលរួមប្រកួតប្រជែងជាមួយលេខាធិការដ្ឋានក.វ.ក</li>
              <li>ការជូនដំណឹងដល់រដ្ឋបាលក្រុង ស្រុកគោលដៅដើម្បីខ្លួនត្រៀមខ្លួនសម្រាប់វាយតម្លៃសមិទ្ធកម្មប្រចាំឆ្នាំ២០២៣។</li>
            </ul>
          </div>
        </div>
      <div class="grid grid-cols-2 gap-6 max-w-screen-xl">
        <DocumentItem v-for="item in workDetail?.pdfFle" :data="item" :key="item.id" />
      </div>

      <ul class="grid grid-cols-3 gap-6">
        <li v-for="img in workDetail?.imagelist">
          <img :src="img.url" alt="">
        </li>
      </ul>

    </section>

  </div>
</template>

<script setup lang="ts">
import TheBanner from '@/components/blocks/TheBanner.vue';
import TheHeading from '@/components/blocks/TheHeading.vue';
import DocumentItem from '@/components/blocks/DocumentItem.vue';

import  { ref, onMounted } from 'vue';
import { useRoute } from 'vue-router';
const route = useRoute();
const urlQuery = route.query;
const urlParma = route.params.id ;
const id = ref(urlParma)
const workDetail = ref();

let listworkshop = [
    {
      id: 1,
      title: "សិក្ខាសាលាផ្សព្វផ្សាយគោលការណ៍ណែនាំស្តីពី ការវាយតម្លៃសមិទ្ធកម្មប្រចាំឆ្នាំសម្រាប់រដ្ឋបាលក្រុង ស្រុកទីតាំង​:​ សណ្ឋាគារ LBN ខេត្តកំពង់ចាម",
      image: "../src/assets/img/kps/kps1/act1.jpeg",
      category: "kbs1",
      datetime: "ថ្ងៃទី០៥ ខែកុម្ភៈ ឆ្នាំ២០២៤",
      description: "",
      pdfFle: [
        { 
          id: 1,
          title: "6.វឌ្ឍនភាព 2024 _(KPC)",
          description: "6.វឌ្ឍនភាព 2024 _(KPC)",
          datetime: "ថ្ងៃទី០៥ ខែកុម្ភៈ ឆ្នាំ២០២៤",
          url: "../src/assets/img/kps/kps1/6.វឌ្ឍនភាព 2024 _(KPC).pdf",
        },
        {
          id: 2,
          title: "7.APA krong srok 2024_(KPC)",
          description: "7.APA krong srok 2024_(KPC)",
          datetime: "ថ្ងៃទី០៥ ខែកុម្ភៈ ឆ្នាំ២០២៤",
          url: "../src/assets/img/kps/kps1/7.APA krong srok 2024_(KPC).pdf",
        }
      ],
      imagelist : [
        {
          url: "../src/assets/img/kps/kps1/act1.jpeg",
        },
        {
          url: "../src/assets/img/kps/kps1/act2.jpeg",
        },
        {
          url: "../src/assets/img/kps/kps1/act3.jpeg",
        },
        {
          url: "../src/assets/img/kps/kps1/act4.jpeg",
        },
        {
          url: "../src/assets/img/kps/kps1/act5.jpeg",
        },
        {
          url: "../src/assets/img/kps/kps1/act6.jpeg",
        },
        {
          url: "../src/assets/img/kps/kps1/act7.jpeg",
        },{
          url: "../src/assets/img/kps/kps1/act8.jpeg",
        },{
          url: "../src/assets/img/kps/kps1/act9.jpeg",
        }
      ]

    },
    {
      id: 2,
      title: "សកម្មភាពសិក្ខាសាលាផ្សព្វផ្សាយគោលការណ៍ណែនាំស្តីពី ការវាយតម្លៃសមិទ្ធកម្មប្រចាំឆ្នាំសម្រាប់រដ្ឋបាលក្រុង ស្រុកទីតាំង​:​ សណ្ឋាគារ ស៊ីប្រ៊ីស ខេត្តព្រះសីហនុ",
      image: "../src/assets/img/kps/kps2/act1.jpeg",
      category: "kbs2",
      datetime: "ថ្ងៃទី០៥ ខែកុម្ភៈ ឆ្នាំ២០២៤",
      description: "",
      pdfFle: [
        { 
          id: 1,
          title: "6.វឌ្ឍនភាព 2024 _(SHV)",
          description: "6.វឌ្ឍនភាព 2024 _(SHV)",
          datetime: "ថ្ងៃទី០៥ ខែកុម្ភៈ ឆ្នាំ២០២៤",
          url: "../src/assets/img/kps/kps2/6.វឌ្ឍនភាព 2024 _(SHV).pdf",
        },
        {
          id: 2,
          title: "7.APA krong srok 2024_(SHV)",
          description: "7.APA krong srok 2024_(SHV)",
          datetime: "ថ្ងៃទី០៥ ខែកុម្ភៈ ឆ្នាំ២០២៤",
          url: "../src/assets/img/kps/kps2/7.APA krong srok 2024_(SHV).pdf",
        }
      ],
      imagelist : [
        {
          url: "../src/assets/img/kps/kps2/act1.jpeg",
        },
        {
          url: "../src/assets/img/kps/kps2/act2.jpeg",
        },
        {
          url: "../src/assets/img/kps/kps2/act3.jpeg",
        },
        {
          url: "../src/assets/img/kps/kps2/act4.jpeg",
        },
        {
          url: "../src/assets/img/kps/kps2/act5.jpeg",
        },
        {
          url: "../src/assets/img/kps/kps2/act6.jpeg",
        },
        {
          url: "../src/assets/img/kps/kps2/act7.jpeg",
        },{
          url: "../src/assets/img/kps/kps2/act8.jpeg",
        },{
          url: "../src/assets/img/kps/kps2/act9.jpeg",
        }
      ]
    },
  ];

  onMounted(() => {
    workDetail.value = listworkshop.find(item => item.id == Number(id.value));
  });

</script>
